{
  "main": {
    "name":"Edison Vargas",
    "occupation":"Java Developer | Mule Developer",
    "description":"",
    "image":"profilepic.jpg",
    "bio":"With proven expertise as a Backend Developer, I have successfully implemented new features and projects using MuleSoft technologies for large organizations across various sectors. Whether employing traditional or agile methodologies, I consistently deliver quality work while effectively managing time and cost constraints.\n\nMy experience as a developer has equipped me with advanced programming skills, a keen eye for clean code, and a strong understanding of code maintainability. I have in-depth knowledge of software metrics, such as cyclomatic complexity and lines of code, and am adept at handling execution governors and limits. My work consistently reflects the best practices in the field, ensuring high-quality outcomes.",
    "email": "helpedison@gmail.com",
    "phone": "",
    "address":{
      "street":"Anywhere",
      "city":"Colombia"

    },
    "website": "https://github.com/helpedison",
    "resumedownload":"",
    "social":[

      {
        "name":"twitter",
        "url":"https://twitter.com/edigramer",
        "className":"fa fa-twitter"
      },

      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/edison-vargas-colombia",
        "className":"fa fa-linkedin"
      },

      {
        "name":"github",
        "url":"https://github.com/helpedison",
        "className":"fa fa-github"
      }

    ]
  },
  "resume":{
    "education":[
      {
        "school":"University Politecnico Grancolombia",
        "degree":"Bachelor Software Engineer",
        "graduated":"Ene 2019 - Present"

      }

    ],
    "work":[
      {
        "company":"Globant",
        "title":"Mulesoft Developer",
        "years":"March 2020 - Present",
        "description":"The projects I worked on involved developing solutions for Salesforce products, primarily addressing integration issues and CloudHub functionalities for telecommunications clients in Argentina. I utilized MuleSoft, adhering to an API-led connectivity design approach and leveraging TM Forum standards. I helped our clients understand the principles and advantages of API-led connectivity, while also focusing on software design tasks.\n\nIn terms of security and reliability, I worked extensively with JWT, implemented policies, and ensured adherence to SLAs within CloudHub. I followed a Git Flow workflow, complemented by agile development methodologies. I undertook Salesforce configurations and optimized flows in MuleSoft to enhance system performance.\n\nIn our pursuit of robust testing and continuous integration, I employed MUnit and implemented CI/CD pipelines on GitLab. To ensure seamless monitoring, I used Visualizer on CloudHub and ElasticSearch APM. Finally, I executed configurations on the Anypoint platform to improve our overall development and deployment processes."
      },
      {
        "company":"Vass",
        "title":"Java Developer",
        "years":"Oct 2019 - March 2020",
        "description":"The project entailed the development of a software solution that manages business processes within a customer portal, leveraging Java web technologies (JSP, Portlets, Spring MVC integrations, OSGi) on the Liferay platform. We employed best practices for constructing and designing RESTful APIs. To ensure security, we integrated JWT and OAuth, all within a high-performance architecture.\nThe front-end was developed using JSP, HTML5, JavaScript, and jQuery, creating an intuitive user interface. As part of our agile methodology, we focused on continuous product maintenance and improvement. This included conducting regular product reviews and refining the quality of the code to uphold the highest standards. Lastly, we gained valuable experience with large-scale distributed architectures, tackling the challenges that come with managing such complex systems while ensuring optimal and efficient software performance."
      },

      {
        "company":"Conexia",
        "title":"Java Developer",
        "years":"Aug 2019 - Oct 2019",
        "description":"The project revolved around software development aimed at managing business processes for insurance products within the healthcare industry. We leveraged Java web technologies such as JSP, JSF PrimeFaces, and Spring MVC integration. The development was executed on a Java Enterprise Edition (JEE) platform, incorporating both REST and Service-Oriented Architecture (SOA).\n\nEmploying agile methodologies, we ensured continuous product maintenance and improvement. Regular product review tasks were a crucial part of our development cycle, as we strove to refine code quality consistently. We also integrated Continuous Integration and Continuous Deployment (CI/CD) practices to streamline our development process and enhance product reliability."
      },
      {
        "company":"Grupodot",
        "title":"Java Developer",
        "years":"April 2018- July 2019",
        "description":"The project was implemented using a variety of cloud technologies on the Google Cloud Platform (GCP), adhering to architectural standards for both monoliths and microservices. We utilized a suite of tools such as Compute Engine, App Engine, Kubernetes Engine, Dataflow, BigQuery, and Container Registry to build, deploy and manage our applications.\n\nWithin the scope of the project, we developed software in portlets to manage business processes for a pensions company. This was achieved using Java Enterprise Edition (JEE) technologies like JSP, JSF, and Portlets, all built on a Liferay platform.\n\nThe software was architected with distributed systems and utilized SOAP protocols, with Mule ESB being instrumental for the creation of flows and service orchestration. Our approach leveraged the strengths of these technologies to ensure a scalable, robust, and efficient solution."
      }
    ],
    "skills":[

      {
        "name":"Pogramming Languages Java, Js, Dataweave ",
        "level":"60%"
      },
      {
        "name":"Libraries, Frameworks -Jquery, Mockito, JSF, Junit, Munit",
        "level":"78%"
      },
      {
        "name":" Tools - JEE, Liferay, Mulesoft, JasperReports, Docker",
        "level":"90%"
      },
      {
        "name":"Databases - PostgreSQL, Mysql",
        "level":"90%"
      }

    ],
    "introduce": "MuleSoft Certified Developer - Integration And API Associate (Mule3) - MuleSoft Certified Developer - lavel 1 (mule4) - RAML - CloudHub - Java developer. He has 5 years of experience in software solutions."
  },
  "portafolio":{
    "projects": [

      {
        "title":"Fondos de pension",
        "description":"Proin gravida nibh vel velit auctor aliquet. Aenean sollicitudin, lorem quis bibendum auctor, nisi elit consequat ipsum, nec sagittis sem nibh id elit.",
        "category":"Ahorros",
        "tags":"Branding, Illustration",
        "image":"ahorros.jpg",
        "url":"http://port7.com",
        "modal":"#modal-07"
      },
      {
        "title":"Telecomunicaciones",
        "description":"Proin gravida nibh vel velit auctor aliquet. Aenean sollicitudin, lorem quis bibendum auctor, nisi elit consequat ipsum, nec sagittis sem nibh id elit.",
        "category":"Web Development",
        "tags":"Photography",
        "image":"telecomunicaciones.jpg",
        "url":"http://port8.com",
        "modal":"#modal-08"
      }
    ]
  }
}